#여행가 A는 NxN 크기의 정사각형 공간 위에 서 있습ㄴ다.
#이 공간은 1x1 크기의 정사각형으로 나누어져 있습니다.
#가장 왼쪽 위 좌표는 (1,1)이며, 가장 오른쪽 알 좌표는 (N,N)에 해당합니다.
#여행가는 상,하,좌,우 방향으로 이동가능하며, 시작 좌표는 항상 (1,1)입니다.
#우리 앞에는 여행가 A가 이동할 계획이 적힌 계획서가 놓여 있습니다.
#계획서에는 하나의 줄에 띄어쓰기를 기준으로 하여  L,R,U,D 중 하나의 문자가 반복적으로 적혀 있습니다.
#L: 왼쪽으로 한칸 이동
#R: 오른쪽으로 한칸 이동
#U: 위로 한 칸 이동
#D: 아래로 한 칸 이동
#공간을 벗어나는 움직이는 무시하며 첫째 줄에는 공간의 크기를 나타내는 N이 주어집니다.
#둘째 줄에는 여행가 A가 이동할 계획서 내용이 주어집니다.
#첫째 줄에 여행가 A가 최종적으로 도착할 지점의 좌표(X,Y)를 공백을 기준으로 구분하여 출력합니다.

n = int(input())
plans = input().split()

x, y = 1, 1

dx = [0, 0, -1, 1]
dy = [-1, 1, 0, 0]
move_type = ['L','R','U','D']

for plan in plans:
    for i in range(len(move_type)):
        if plan == move_type[i]:
            nx = x + dx[i]
            ny = y + dy[i]
    
    if nx < 1 or ny < 1 or nx > n or ny > n:
        continue
    x, y = nx, ny

print(x,y)

